[
    {
        "title": "รัฐประหารคืออะไร",
        "subtitle": "รัฐประหาร (อังกฤษ: coup d'état หรือ coup) คือ...",
        "img_url": "https://cdn.pixabay.com/photo/2016/09/20/14/06/soldier-1682561_960_720.jpg",
        "detail":"คือ การยึดอำนาจและถอดถอนรัฐบาล ซึ่งมักกระทำด้วยวิธีการอันผิดกฎหมายและนอกรัฐธรรมนูญ และเป็นการกระทำของกลุ่มทางการเมือง ทหาร หรือผู้เผด็จการ นักวิชาการหลายคนมองว่า รัฐประหารเป็นอันสำเร็จ ถ้าผู้ยึดอำนาจสามารถควบคุมอำนาจไว้ได้อย่างน้อยเจ็ดวัน"
      
    },
    {
        "title": "Fake News คือ",
        "subtitle": "ข่าวปลอม หรือ ข่าวลวง เป็นการหนังสือพิมพ์เหลือง (yellow journalism) หรือการโฆษณาชวนเชื่อซึ่งประกอบด้วย...",
        "img_url": "https://cdn.pixabay.com/photo/2017/09/08/03/51/corruption-2727571_960_720.png",
        "detail":"ข้อมูลเป็นเท็จที่นำเสนอเป็นข่าวโดยมีความประสงค์เพื่อชักนำบุคคลในทางที่ผิด เพื่อสร้างความเสียหายต่อหน่วยงาน นิติบุคคลหรือบุคคล หรือเพื่อให้ได้ผลประโยชน์ทางการเงินหรือเพื่อชักจูงการเมือง ผู้สร้างข่าวปลอม หรือ Fake News มักใช้ข้อความพาดหัวในลักษณะเร้าอารมณ์ หลอกลวง หรือกุขึ้นทั้งหมดเพื่อเพิ่มยอดผู้อ่าน การแบ่งปันออนไลน์ และรายได้จากคลิกอินเทอร์เน็ต ซึ่งในกรณีหลัง คล้ายกับพาดหัว คลิกเบต ออนไลน์เร้าอารมณ์และอาศัยรายได้จากการโฆษณาโดยไม่สนใจว่าเรื่องที่พิมพ์นั้นจะถูกต้องหรือไม่"
    },
    {
        "title": "ย้อนดูสถิติรัฐประหารทั่วโลก",
        "subtitle": "19 กันยายน 2549 คือวันที่คณะปฏิรูปการปกครองในระบอบประชาธิปไตยอันมีพระมหา...",
        "img_url": "https://c1.staticflickr.com/5/4439/37192385646_17cfe8dcd6.jpg",
        "detail":"นี่คือส่วนหนึ่งของบรรดาประเทศที่เกิดการปฏิวัติ/รัฐประหารยึดอำนาจสำเร็จมากที่สุด นับตั้งแต่ศตวรรษที่ 20 (ปี ค.ศ. 1901-ปัจจุบัน) โดยประเทศในลาตินอเมริกาส่วนใหญ่ล้วนแล้วแต่เคยผ่านการปฏิวัติ/รัฐประหารโดยกองทัพมานับครั้งไม่ถ้วน จึงไม่น่าแปลกใจที่ถ้าหากจะเริ่มนับการทำรัฐประหารตั้งแต่ศตวรรษที่ 20 เป็นต้นมา ประเทศอย่างโบลิเวียและปารากวัย จะยังคงมีสถิติยึดอำนาจสำเร็จมากที่สุด แต่อย่างไรก็ตามในช่วงไม่กี่ทศวรรษที่ผ่านมา ประเทศในภูมิภาคนี้ส่วนใหญ่ล้วนแต่มีบทเรียนที่ได้รับจากการรัฐประหารยึดอำนาจโดยกองทัพ และทราบดีว่า เผด็จการทหารไม่ใช่คำตอบสุดท้ายของการแก้ไขปัญหาอีกต่อไป การรัฐประหารโดยกองทัพครั้งล่าสุด เกิดขึ้นที่เมียนมาในวันนี้ (2021) หลัง พล.อ. อาวุโส มิน อ่อง หล่าย ผู้บัญชาการทหารสูงสุดกองทัพเมียนมาได้เป็นผู้นำรัฐประหารเข้ารักษาอำนาจรัฐบาลแล้ว และได้ประกาศสถานการณ์ฉุกเฉินทั่วประเทศเป็นระยะเวลา 1 ปี พร้อมแต่งตั้ง พล.อ. อู มิน ส่วย รองประธานาธิบดีได้รับการสนับสนุนจากกองทัพ ขึ้นรักษาการตำแหน่งประธานาธิบดีเมียนมาชั่วคราว โดยโฆษกพรรคสันนิบาตแห่งชาติเพื่อประชาธิปไตย (NLD) ยืนยันว่า กองทัพเมียนมาได้ควบคุมตัว ออง ซาน ซูจี ที่ปรึกษาประเทศ และเจ้าหน้าที่ระดับสูงของรัฐบาลพลเรือนอีกหลายคนไว้ในกรุงเนปิดอว์ สัญญาณโทรศัพท์ อินเทอร์เน็ตถูกตัดการติดต่อสื่อสาร ก่อนที่จะทำการยึดอำนาจ และออกแถลงการณ์ผ่านสถานีโทรทัศน์ โดยอ้างว่าการเลือกตั้งครั้งล่าสุด เมื่อปลายปี 2020 ที่ผ่านมาไม่โปร่งใส กองทัพจึงจำเป็นจะต้องยึดอำนาจและปกป้องรัฐธรรมนูญ นับเป็นการกลับขึ้นสู่อำนาจอีกครั้งของรัฐบาลทหาร ภายหลังจากการจัดตั้งรัฐบาลพลเรือนครั้งแรกในรอบหลายสิบปี เมื่อปี 2016 ที่ผ่านมา  กองทัพเริ่มเข้ามามีบทบาทในทางการเมืองเมียนมาตั้งแต่ปี 1958 ก่อนที่กองทัพเมียนมา นำโดยนายพล เนวินจะก่อการรัฐประหารอย่างเป็นทางการในปี 1962 ยึดอำนาจจากนายกรัฐมนตรีอู้นุ ซึ่งถือเป็นจุดเริ่มต้นระบอบเผด็จการทหารที่กัดกร่อนสังคมเมียนมาอยู่นานหลายทศวรรษ  ขณะที่ไทยทำรัฐประหารสำเร็จมากถึง 13 ครั้ง มากที่สุดในย่านอาเซียน โดยครั้งล่าสุดเกิดขึ้นเมื่อเหตุการณ์รัฐประหาร ปี 2014 ซึ่งมี พล.อ. ประยุทธ์ จันทร์โอชา เป็นผู้นำรัฐประหาร และดำรงตำแหน่งนายกรัฐมนตรีของประเทศไทย นับตั้งแต่นั้นจนถึงปัจจุบัน ตามมาด้วยซีเรีย อัฟกานิสถาน รวมถึงประเทศส่วนใหญ่ในทวีปแอฟริกา ที่เกิดการปฏิวัติ/รัฐประหารบ่อยครั้งตลอดศตวรรษที่ 20 เป็นต้นมา"
    },
    {
        "title": "What is RAM?",
        "subtitle": "Ram (Random-access memory) หรือ แรม เป็นหน่วยความจำหลักของคอมพิวเตอร์...",
        "img_url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Elixir_M2U51264DS8HC3G-5T_20060320.jpg",
        "detail":"Ram (Random-access memory) หรือ แรม เป็นหน่วยความจำหลักของคอมพิวเตอร์ ซึ่งเป็นองค์ประกอบสำคัญที่มีผลต่อประสิทธิภาพการทำงานโดยรวม ทั้งยังส่งผลต่อความเร็วในการทำงานของระบบคอมพิวเตอร์ ไม่ว่าอุปกรณ์ชนิดนั้นจะเป็นสมาร์ทโฟน, แท็บเล็ต, คอมพิวเตอร์ หรืออุปกรณ์ใดๆ ที่จำเป็นต้องอ่านและเขียนคำสั่งไปยังหน่วยความจำRAM จัดว่าเป็นหน่วยความจำชั่วคราว (Short-Term Memory) โดยการทำงานของมันนั้นจะเป็นการเขียนหรือบันทึกข้อมูลแบบสุ่ม ซึ่งหน่วยความจำชนิดนี้จะสามารถบันทึกข้อมูลลงในตำแหน่งต่างๆ ได้อย่างอิสระ ทั้งนี้ก็เพื่อเพิ่มความเร็วในการบันทึกและอ่านข้อมูล จึงเป็นที่มาของคำว่า Random access ขณะเดียวกันก็ทำให้มันแตกต่างจากหน่วยความจำประเภทอื่นๆ อย่างสิ้นเชิง เมื่อเทียบกับฮาร์ดไดร์ฟ (Hard Drive) หรือ SSD (ที่รู้จักกันในนามของ Direct Access Memory) สิ่งที่ทำให้มันแตกต่างจากหน่วยความจำที่เข้าถึงได้โดยตรงนั่นก็คือ เมื่อมีการตัดกระแสไฟฟ้าหรือปิดคอมพิวเตอร์ ข้อมูลที่อยู่ภายใน Ram ก็จะหายไปอย่างสมบูรณ์ เนื่องจากลักษณะเฉพาะของมัน ข้อมูลที่ถูกจัดการโดย RAM จึงมีการเปลี่ยนแปลงหรือผันผวนอยู่ตลอดเวลา และมีการประมวลผลที่เกิดขึ้นเฉพาะในช่วงเวลาที่กำหนดเท่านั้น ปัจจุบัน โมดูล Ram รูปแบบใหม่กำลังได้รับการพัฒนาอย่างต่อเนื่อง เพื่อให้สามารถจัดเก็บงาน (Task) อื่นๆ ซึ่งหมายถึงการดำเนินการบางอย่าง เช่น การเริ่มต้นระบบ (System Start Up) ที่อาจเกิดได้เร็วขึ้นกว่าเดิมเนื่องจากการกระทำเหล่านั้นได้มีการเตรียมพร้อมสำหรับเรียกใช้"
    },
    {
        "title": "What is FRONTEND?",
        "subtitle": "front-end  หมายถึง โปรแกรมหนึ่งโปรแกรมใด...",
        "img_url": "https://miro.medium.com/max/2000/1*OaQpmkPzetUvWAB5sO9ZVg.png",
        "detail":"front-end  หมายถึง โปรแกรมหนึ่งโปรแกรมใด หรือคอมพิวเตอร์เครื่องหนึ่งเครื่องใดที่ซ่อนรายละเอียดของการเข้าถึงข้อมูลเอาไว้ สรุปง่าย ๆ ได้ว่า ตัวโปรแกรมนั้นเองที่มีตัวเสริมหน้า เป็นตัวกันมิให้ใครเข้าถึงข้อมูลได้ นอกจากจะรู้จักคำสั่งต่าง ๆ จะเรียกกันสั้นๆว่า หน้าบ้าน หรือเป็นส่วนติดต่อผู้ใช้ (User interface) ไม่ว่าจะเป็น หน้าโฮม หน้าเว็บเพจ เนื้อหาต่างๆ รูปภาพ ลิงก์ เป็นต้น เป็นส่วนที่ user ทั่วไปสามารถเห็นและเข้ามาใช้งานได้ของเว็บไซต์ ส่วนนี้จะแสดงหน้าตาของเว็บไซต์ให้ผู้เข้าชมเห็น การออกแบบก็เป็นส่วนที่ช่วยดึงดูดและทำให้ผู้อื่นสนใจเว็บไซต์ ทั้งความสวยงาม การใช้งานเว็บไซต์ที่เข้าใจง่าย สะดวก และทำให้ผู้เข้าชมเห็นว่าเว็บไซต์มีการพัฒนาอยู่ตลอด"
    },
    {
        "title": "Dart คือ",
        "subtitle": "Dart ภาษา...",
        "img_url": "https://cdn.pixabay.com/photo/2016/09/20/14/06/soldier-1682561_960_720.jpg",
        "detail":"คือ Dart นั้นเป็นภาษาโปรแกรมที่เอาไว้สำหรับสร้างแอพพลิเคชันบนแพลตฟอร์มที่หลากหลายโดยได้ทั้ง mobile, desktop, server และก็ web สิ่งที่เป็นที่นิยมที่สุดที่ทำให้คนสนใจมาเรียนภาษา Dart กันก็คือเพื่อที่จะเอาไปใช้ร่วมกับ Flutter ที่เป็นเครื่องมือช่วยสร้าง UI ของ Google ซึ่งใช้ได้ทั้งกับ Android และ iOS หรือจะเป็นใน Desktop กับ Web ก็ยังได้ CD. https://www.borntodev.com/2020/04/11/%E0%B9%80%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%99-dart-%E0%B9%81%E0%B8%9A%E0%B8%9A%E0%B8%81%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%94%E0%B8%94/"
      
    }
]